package ru.bardinpetr.itmo.lab_4.story;

import ru.bardinpetr.itmo.lab_4.story.stories.MainStory;

public class App {
    public static void main(String[] args) {
        var story = (new MainStory()).compile();
        System.out.println(story.tell());

//+ За рекой был лес.
//+ Коротышки делали из березовой коры лодочки, переплывали через реку и ходили в лес за ягодами, за грибами, за орехами.
//+ Собирать ягоды было трудно, потому что коротышки ведь были крошечные, а за орехами и вовсе приходилось лазить на высокий куст да еще тащить с собой пилу.
//+ Ни один коротышка не смог бы сорвать орех руками -- их надо было пилить пилой.
//+ Грибы тоже пилили пилой.
//+ Спилят гриб под самый корень, потом распилят его на части и тащат по кусочкам домой.
//+ Коротышки были неодинаковые: одни из них назывались малышами, а другие -- малышками.

// Малыши всегда ходили либо в длинных брюках навыпуск, либо в коротеньких штанишках на помочах, а малышки любили носить платьица из пестренькой, яркой материи.
// Малыши не любили возиться со своими прическами, и поэтому волосы у них были короткие, а у малышек волосы были длинные, чуть не до пояса.
// Малышки очень любили делать разные красивые прически, волосы заплетали в длинные косы и в косы вплетали ленточки, а на голове носили бантики.
// Многие малыши очень гордились тем, что они малыши, и совсем почти не дружили с малышками.
// А малышки гордились тем, что они малышки, и тоже не хотели дружить с малышами.
// Если какая-нибудь малышка встречала на улице малыша, то, завидев его издали, сейчас же переходила на другую сторону улицы.
// И хорошо делала, потому что среди малышей часто попадались такие, которые не могли спокойно пройти мимо малышки, а обязательно скажут ей что-нибудь обидное, даже толкнут или, еще того хуже, за косу дернут.
// Конечно, не все малыши были такие, но ведь этого на лбу у них не написано, поэтому малышки считали, что лучше заранее перейти на другую сторону улицы и не попадаться навстречу.
// За это многие малыши называли малышек воображульками -- придумают же такое слово! -- а многие малышки называли малышей забияками и другими обидными прозвищами.
// Некоторые читатели сразу скажут, что все это, наверно, выдумки, что в жизни таких малышей не бывает.
// Но никто ведь и не говорит, что они в жизни бывают.
// В жизни -- это одно, а в сказочном городе -- совсем другое.
// В сказочном городе все бывает.
//+ В одном домике на улице Колокольчиков жило шестнадцать малышей-коротышей.

// Самым главным из них был малыш-коротыш, по имени Знайка.
// Его прозвали Знайкой за то, что он знал очень много.
// А знал он много потому, что читал разные книги.
// Эти книги лежали у него и на столе, и под столом, и на кровати, и под кроватью.
// В его комнате не было такого места, где бы не лежали книги.
// От чтения книг Знайка сделался очень умным.
// Поэтому все его слушались и очень любили.
// Одевался он всегда в черный костюм, а когда садился за стол, надевал на нос очки и начинал читать какую-нибудь книгу, то совсем становился похож на профессора.

// + В этом же домике жил известный доктор Пилюлькин, который лечил коротышек от всех болезней.
// + Он всегда ходил в белом халате, а на голове носил белый колпак с кисточкой.
// + Жил здесь также знаменитый механик Винтик со своим помощником Шпунтиком; жил Сахарин Сахариныч Сиропчик, который прославился тем, что очень любил газированную воду с сиропом.
// + Он был очень вежливый.
// + Ему нравилось, когда его называли по имени и отчеству, и не нравилось, когда кто-нибудь называл его просто Сиропчиком.
// + Жил еще в этом доме охотник Пулька.
// + У него была маленькая собачка Булька и еще было ружье, которое стреляло пробками.
// + Жил художник Тюбик, музыкант Гусля и другие малыши: Торопыжка, Ворчун, Молчун, Пончик, Растеряйка, два брата -- Авоська и Небоська.
// + Но самым известным среди них был малыш, по имени Незнайка.
// + Его прозвали Незнайкой за то, что он ничего не знал.
// + Этот Незнайка носил яркую голубую шляпу, желтые, канареечные, брюки и оранжевую рубашку с зеленым галстуком.
// + Он вообще любил яркие краски.
// + Нарядившись таким попугаем, Незнайка по целым дням слонялся по городу, сочинял разные небылицы и всем рассказывал.
// + Кроме того, он постоянно обижал малышек.
// + Поэтому малышки, завидев издали его оранжевую рубашку, сейчас же поворачивали в обратную сторону и прятались по домам.
// + У Незнайки был друг, по имени Гунька, который жил на улице Маргариток.
// + С Гунькой Незнайка мог болтать по целым часам.
// + Они двадцать раз на день ссорились между собой и двадцать раз на день мирились.        

// В особенности Незнайка прославился после одной истории.
// Однажды он гулял по городу и забрел в поле.
// Вокруг не было ни души.
// В это время летел майский жук.
// Он сослепу налетел на Незнайку и ударил его по затылку.
// Незнайка кубарем покатился на землю.
// Жук в ту же минуту улетел и скрылся вдали.
// Незнайка вскочил, стал оглядываться по сторонам и смотреть, кто это его ударил.
// Но кругом никого не было.
// "Кто же это меня ударил? -- думал Незнайка.
// -- Может быть, сверху упало что-нибудь?" Он задрал голову и поглядел вверх, но вверху тоже ничего не было.
// Только солнце ярко сияло над головой у Незнайки.
    }
}
